app/admin/dashboard.rb

SELECT COUNT(*) AS count_all, "complaints"."state" AS complaints_state FROM "complaints" GROUP BY "complaints"."state"
---
    h2 "Таблиця скарг", style: "text-align: center;"
    div class: "blank_slate_container", id: "dashboard_default_message" do
      span class: "blank_slate" do
        pie_chart Complaint.all.group_by { |complaint| t("state.#{complaint.state}") }.map { |el| [el[0], el[1].count] }