app/controllers/complaints_controller.rb

SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
  def create
    params[:complaint][:consumer_id] = Consumer.find_by(id: params[:complaint][:consumer]).id if params[:complaint][:consumer]

SELECT "complaints".* FROM "complaints"
---
  def index
    @complaints = Complaint.all